nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
/*
 * Copyright 2022 NXP 
 *
 * NXP Confidential. This software is owned or controlled by NXP and may only be used strictly in accordance with the applicable license terms found at https://www.nxp.com/docs/en/disclaimer/LA_OPT_NXP_SW.html.
 */

#include <mcinit_qmc2g_imxrt1170.h>
#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_clock.h"
#include "fsl_gpio.h"
#include "pin_mux.h"
#include "FreeRTOSConfig.h"

static channel_table_t sChannelTableM1 = {M1_ADC1_IA, M1_ADC2_IA, M1_ADC1_IB, M1_ADC2_IB, M1_ADC1_IC, M1_ADC2_IC, M1_ADC1_VDC, M1_ADC2_VDC, M1_ADC1_AUX, M1_ADC2_AUX};
static channel_table_t sChannelTableM2 = {M2_ADC1_IA, M2_ADC2_IA, M2_ADC1_IB, M2_ADC2_IB, M2_ADC1_IC, M2_ADC2_IC, M2_ADC1_VDC, M2_ADC2_VDC, M2_ADC1_AUX, M2_ADC2_AUX};
static channel_table_t sChannelTableM3 = {M3_ADC1_IA, M3_ADC2_IA, M3_ADC1_IB, M3_ADC2_IB, M3_ADC1_IC, M3_ADC2_IC, M3_ADC1_VDC, M3_ADC2_VDC, M3_ADC1_AUX, M3_ADC2_AUX};
static channel_table_t sChannelTableM4 = {M4_ADC1_IA, M4_ADC2_IA, M4_ADC1_IB, M4_ADC2_IB, M4_ADC1_IC, M4_ADC2_IC, M4_ADC1_VDC, M4_ADC2_VDC, M4_ADC1_AUX, M4_ADC2_AUX};
qdc_block_t g_sM1QdcSensor,g_sM2QdcSensor,g_sM3QdcSensor,g_sM4QdcSensor;
mcdrv_adc_t g_sM1AdcSensor,g_sM2AdcSensor,g_sM3AdcSensor,g_sM4AdcSensor;
mcdrv_pwm3ph_pwma_t g_sM1Pwm3ph,g_sM2Pwm3ph,g_sM3Pwm3ph,g_sM4Pwm3ph;

/*******************************************************************************
 * Code
 ******************************************************************************/



/*!
 * @brief eFlexPWM1 initialization which controls Motor1. Synchronization with eFlexPWM2~4 and ADC_ETC are implemented here as well. Hal driver is initialized in the end.
 *
 * @param void  No input parameter
 *
 * @return None
 */



static void eFlexPWM1_init(void)
{
	int16_t  i16Tmp;

	CLOCK_EnableClock(kCLOCK_Pwm1);

	/* Sub-module counter sync and buffered registers reload setting */
	PWM1->SM[0].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM1->SM[0].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM1->SM[0].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM1->SM[0].CTRL2 = (PWM1->SM[0].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM1->SM[0].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM1->SM[0].CTRL2 = (PWM1->SM[0].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(0); // use local sync for SM0
	PWM1->SM[0].CTRL2 &= ~PWM_CTRL2_RELOAD_SEL_MASK; // use local reload signal

	PWM1->SM[1].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM1->SM[1].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM1->SM[1].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM1->SM[1].CTRL2 = (PWM1->SM[1].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(2);   // SM0's clock is used
	PWM1->SM[1].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM1->SM[1].CTRL2 = (PWM1->SM[1].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(2); // use master sync from SM0
	PWM1->SM[1].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

	PWM1->SM[2].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM1->SM[2].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM1->SM[2].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM1->SM[2].CTRL2 = (PWM1->SM[2].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(2);   // SM0's clock is used
	PWM1->SM[2].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM1->SM[2].CTRL2 = (PWM1->SM[2].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(2); // use master sync from SM0
	PWM1->SM[2].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

	PWM1->SM[3].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM1->SM[3].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM1->SM[3].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM1->SM[3].CTRL2 = (PWM1->SM[3].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(2);   // SM0's clock is used
	PWM1->SM[3].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM1->SM[3].CTRL2 = (PWM1->SM[3].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(2); // use master sync from SM0
	PWM1->SM[3].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

	/* PWM frequency and duty setting */
#ifdef OVERDRIVE_MODE
	PWM1->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM1->SM[0].VAL1  = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#else
	PWM1->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM1->SM[0].VAL1  = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#endif
	PWM1->SM[0].VAL0 = 0;
	PWM1->SM[0].VAL2  = PWM1->SM[0].INIT/2; // 50% duty
	PWM1->SM[0].VAL3  = PWM1->SM[0].VAL1/2; // 50% duty

	PWM1->SM[1].INIT  = PWM1->SM[0].INIT;
	PWM1->SM[1].VAL1  = PWM1->SM[0].VAL1;
	PWM1->SM[1].VAL0 = 0;
	PWM1->SM[1].VAL2  = PWM1->SM[0].VAL2;
	PWM1->SM[1].VAL3  = PWM1->SM[0].VAL3;

	PWM1->SM[2].INIT  = PWM1->SM[0].INIT;
	PWM1->SM[2].VAL1  = PWM1->SM[0].VAL1;
	PWM1->SM[2].VAL0 = 0;
	PWM1->SM[2].VAL2  = PWM1->SM[0].VAL2;
	PWM1->SM[2].VAL3  = PWM1->SM[0].VAL3;

	PWM1->SM[3].INIT  = PWM1->SM[0].INIT;
	PWM1->SM[3].VAL1  = PWM1->SM[0].VAL1;
	PWM1->SM[3].VAL0 = 0;

	/* Deadtime setting */
#ifdef OVERDRIVE_MODE
	PWM1->SM[0].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[0].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[1].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[1].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[2].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[2].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
#else
	PWM1->SM[0].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[0].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[1].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[1].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[2].DTCNT0 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM1->SM[2].DTCNT1 = M1_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
#endif

