nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
	/* PWM2, PWM3 and PWM4 synchronization */
	PWM1->SM[3].VAL4 = (int16_t)(PWM1->SM[3].INIT)/2;  // 1/4 PWM period
	PWM1->SM[3].VAL5 = 0;                   // 1/2 PWM period
	PWM1->SM[0].VAL4 = PWM1->SM[0].VAL1/2;  // 3/4 PWM period
	PWM1->SM[0].TCTRL = 0;
	PWM1->SM[1].TCTRL = 0;
	PWM1->SM[2].TCTRL = 0;
	PWM1->SM[3].TCTRL = 0;
	PWM1->SM[3].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x30); // Use VAL4, VAL5 of SM3 for trigger point - synchronize PWM2, PWM3
	PWM1->SM[0].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x10); // Use VAL4 of SM0 for trigger point - synchronize PWM4

	/* ADC_ETC triggering point setting */
#ifdef OVERDRIVE_MODE
	i16Tmp = (int16_t)(((float_t)M1_ADC_TRIGGER_DELAY - M1_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000);
#else
	i16Tmp = (int16_t)(((float_t)M1_ADC_TRIGGER_DELAY - M1_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000);
#endif
	if(i16Tmp >= 0) // Setup ADC triggering point
	{
		PWM1->SM[0].VAL5 = PWM1->SM[0].INIT + i16Tmp;
	}
	else
	{
		PWM1->SM[0].VAL5 = PWM1->SM[0].VAL1 + i16Tmp;
	}
	PWM1->SM[0].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x20); // Use VAL5 of SM0 for trigger point - M1 voltage and currents
	PWM1->SM[0].INTEN = PWM_INTEN_CMPIE(0x20); // for debug

#ifdef OVERDRIVE_MODE
	i16Tmp = (int16_t)(((float_t)M2_ADC_TRIGGER_DELAY - M2_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000);
#else
	i16Tmp = (int16_t)(((float_t)M2_ADC_TRIGGER_DELAY - M2_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000);
#endif
	PWM1->SM[1].VAL4 = (int16_t)(PWM1->SM[0].INIT)/2 + i16Tmp;
	PWM1->SM[1].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x10); // Use VAL4 of SM1 for trigger point - M2 voltage and currents
	PWM1->SM[1].INTEN = PWM_INTEN_CMPIE(0x10); // for debug

#ifdef OVERDRIVE_MODE
	i16Tmp = (int16_t)(((float_t)M3_ADC_TRIGGER_DELAY - M3_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000);
#else
	i16Tmp = (int16_t)(((float_t)M3_ADC_TRIGGER_DELAY - M3_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000);
#endif
	PWM1->SM[1].VAL5 = PWM1->SM[0].VAL0 + i16Tmp;
	PWM1->SM[1].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x20); // Use VAL5 of SM1 for trigger point - M3 voltage and currents
	PWM1->SM[1].INTEN |= PWM_INTEN_CMPIE(0x20); // for debug

#ifdef OVERDRIVE_MODE
	i16Tmp = (int16_t)(((float_t)M4_ADC_TRIGGER_DELAY - M4_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000);
#else
	i16Tmp = (int16_t)(((float_t)M4_ADC_TRIGGER_DELAY - M4_ADC_AVERAGE_TIME*0.5f)*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000);
#endif
	PWM1->SM[2].VAL4 = PWM1->SM[0].VAL1/2 + i16Tmp;
	PWM1->SM[2].TCTRL |= PWM_TCTRL_OUT_TRIG_EN(0x10); // Use VAL4 of SM2 for trigger point - M4 voltage and currents
	PWM1->SM[2].INTEN = PWM_INTEN_CMPIE(0x10); // for debug

	/* Fault protection setting: Fault protects PWMA&PWMB outputs of SM0~SM2 */
	PWM1->SM[0].DISMAP[0] = 0;
	PWM1->SM[1].DISMAP[0] = 0;
	PWM1->SM[2].DISMAP[0] = 0;

	PWM1->SM[0].DISMAP[0] = (PWM1->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M1_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M1_FAULT_NUM);
	PWM1->SM[1].DISMAP[0] = (PWM1->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M1_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M1_FAULT_NUM);
	PWM1->SM[2].DISMAP[0] = (PWM1->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M1_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M1_FAULT_NUM);

	PWM1->FCTRL = (PWM1->FCTRL & ~PWM_FCTRL_FLVL_MASK)|PWM_FCTRL_FLVL(1<<M1_FAULT_NUM); // A logic 1 on fault indicates a fault condition
	PWM1->FCTRL = (PWM1->FCTRL & ~PWM_FCTRL_FAUTO_MASK); // Manual clearing for fault0~3
	PWM1->FCTRL = (PWM1->FCTRL & ~PWM_FCTRL_FSAFE_MASK)|PWM_FCTRL_FSAFE(1<<M1_FAULT_NUM); // Safe mode for fault

	PWM1->FSTS = (PWM1->FSTS & ~PWM_FSTS_FFULL_MASK)|PWM_FSTS_FFULL(1<<M1_FAULT_NUM); // Full cycle recovery for fault0
	PWM1->FCTRL2 = (PWM1->FCTRL2 & ~PWM_FCTRL2_NOCOMB_MASK)|PWM_FCTRL2_NOCOMB(1<<M1_FAULT_NUM); // No combinational path for fault. Fault signal will be filtered
	PWM1->FFILT = PWM_FFILT_FILT_CNT(3)|PWM_FFILT_FILT_PER(2);

	/* End of PWM initialization, setting LDOK */
	PWM1->MCTRL = PWM_MCTRL_CLDOK(0x7); // Clear LDOK of SM0~SM2
	PWM1->MCTRL |= PWM_MCTRL_LDOK(0x7); // Set LDOK of SM0~SM2


    /* Initialize MC driver */
    g_sM1Pwm3ph.pui32PwmBaseAddress = (PWM_Type *)PWM1;

    g_sM1Pwm3ph.ui16PhASubNum = M1_PWM_PAIR_PHA; /* PWMA phase A sub-module number */
    g_sM1Pwm3ph.ui16PhBSubNum = M1_PWM_PAIR_PHB; /* PWMA phase B sub-module number */
    g_sM1Pwm3ph.ui16PhCSubNum = M1_PWM_PAIR_PHC; /* PWMA phase C sub-module number */

    g_sM1Pwm3ph.ui16FaultFixNum = M1_FAULT_NUM; /* PWMA fixed-value over-current fault number */
    g_sM1Pwm3ph.ui16FaultAdjNum = M1_FAULT_NUM; /* PWMA adjustable over-current fault number */

}

static void eFlexPWM2_init(void) // Synchronized with PWM1
{
	CLOCK_EnableClock(kCLOCK_Pwm2);

	/* Sub-module counter sync and buffered registers reload setting */
	PWM2->SM[0].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM2->SM[0].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM2->SM[0].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM2->SM[0].CTRL2 = (PWM2->SM[0].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM2->SM[0].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM2->SM[0].CTRL2 = (PWM2->SM[0].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(3); // use external sync
	PWM2->SM[0].CTRL2 &= ~PWM_CTRL2_RELOAD_SEL_MASK; // use local reload signal

	PWM2->SM[1].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM2->SM[1].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM2->SM[1].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM2->SM[1].CTRL2 = (PWM2->SM[1].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM2->SM[1].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM2->SM[1].CTRL2 = (PWM2->SM[1].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(3); // use external sync
	PWM2->SM[1].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

