nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
	PWM2->SM[2].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM2->SM[2].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM2->SM[2].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM2->SM[2].CTRL2 = (PWM2->SM[2].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM2->SM[2].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM2->SM[2].CTRL2 = (PWM2->SM[2].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(3); // use external sync
	PWM2->SM[2].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

	/* PWM frequency and duty setting */
#ifdef OVERDRIVE_MODE
	PWM2->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM2->SM[0].VAL1  = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#else
	PWM2->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM2->SM[0].VAL1  = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#endif
	PWM2->SM[0].VAL0 = 0;
	PWM2->SM[0].VAL2  = PWM2->SM[0].INIT/2; // 50% duty
	PWM2->SM[0].VAL3  = PWM2->SM[0].VAL1/2; // 50% duty

	PWM2->SM[1].INIT  = PWM2->SM[0].INIT;
	PWM2->SM[1].VAL1  = PWM2->SM[0].VAL1;
	PWM2->SM[1].VAL0 = 0;
	PWM2->SM[1].VAL2  = PWM2->SM[0].VAL2;
	PWM2->SM[1].VAL3  = PWM2->SM[0].VAL3;

	PWM2->SM[2].INIT  = PWM2->SM[0].INIT;
	PWM2->SM[2].VAL1  = PWM2->SM[0].VAL1;
	PWM2->SM[2].VAL0 = 0;
	PWM2->SM[2].VAL2  = PWM2->SM[0].VAL2;
	PWM2->SM[2].VAL3  = PWM2->SM[0].VAL3;

	/* Deadtime setting */
#ifdef OVERDRIVE_MODE
	PWM2->SM[0].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[0].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[1].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[1].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[2].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[2].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
#else
	PWM2->SM[0].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[0].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[1].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[1].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[2].DTCNT0 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM2->SM[2].DTCNT1 = M2_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
#endif

	/* Fault protection setting: Fault protects PWMA&PWMB outputs of SM0~SM2 */
	PWM2->SM[0].DISMAP[0] = 0;
	PWM2->SM[1].DISMAP[0] = 0;
	PWM2->SM[2].DISMAP[0] = 0;

	PWM2->SM[0].DISMAP[0] = (PWM2->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M2_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M2_FAULT_NUM);
	PWM2->SM[1].DISMAP[0] = (PWM2->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M2_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M2_FAULT_NUM);
	PWM2->SM[2].DISMAP[0] = (PWM2->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M2_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M2_FAULT_NUM);

	PWM2->FCTRL = (PWM2->FCTRL & ~PWM_FCTRL_FLVL_MASK)|PWM_FCTRL_FLVL(1<<M1_FAULT_NUM); // A logic 1 on fault indicates a fault condition
	PWM2->FCTRL = (PWM2->FCTRL & ~PWM_FCTRL_FAUTO_MASK); // Manual clearing for fault0~3
	PWM2->FCTRL = (PWM2->FCTRL & ~PWM_FCTRL_FSAFE_MASK)|PWM_FCTRL_FSAFE(1<<M1_FAULT_NUM); // Safe mode for fault

	PWM2->FSTS = (PWM2->FSTS & ~PWM_FSTS_FFULL_MASK)|PWM_FSTS_FFULL(1<<M2_FAULT_NUM); // Full cycle recovery for fault0
	PWM2->FCTRL2 = (PWM2->FCTRL2 & ~PWM_FCTRL2_NOCOMB_MASK)|PWM_FCTRL2_NOCOMB(1<<M2_FAULT_NUM); // No combinational path for fault. Fault signal will be filtered
	PWM2->FFILT = PWM_FFILT_FILT_CNT(3)|PWM_FFILT_FILT_PER(2);

	/* End of PWM initialization, setting LDOK */
	PWM2->MCTRL = PWM_MCTRL_CLDOK(0x7); // Clear LDOK of SM0~SM2
	PWM2->MCTRL |= PWM_MCTRL_LDOK(0x7); // Set LDOK of SM0~SM2

    /* Initialize MC driver */
    g_sM2Pwm3ph.pui32PwmBaseAddress = (PWM_Type *)PWM2;

    g_sM2Pwm3ph.ui16PhASubNum = M2_PWM_PAIR_PHA; /* PWMA phase A sub-module number */
    g_sM2Pwm3ph.ui16PhBSubNum = M2_PWM_PAIR_PHB; /* PWMA phase B sub-module number */
    g_sM2Pwm3ph.ui16PhCSubNum = M2_PWM_PAIR_PHC; /* PWMA phase C sub-module number */

    g_sM2Pwm3ph.ui16FaultFixNum = M2_FAULT_NUM; /* PWMA fixed-value over-current fault number */
    g_sM2Pwm3ph.ui16FaultAdjNum = M2_FAULT_NUM; /* PWMA adjustable over-current fault number */

}

static void eFlexPWM3_init(void) // Synchronized with PWM1
{
	CLOCK_EnableClock(kCLOCK_Pwm3);

	/* Sub-module counter sync and buffered registers reload setting */
	PWM3->SM[0].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM3->SM[0].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM3->SM[0].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM3->SM[0].CTRL2 = (PWM3->SM[0].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM3->SM[0].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM3->SM[0].CTRL2 = (PWM3->SM[0].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(3); // use external sync
	PWM3->SM[0].CTRL2 &= ~PWM_CTRL2_RELOAD_SEL_MASK; // use local reload signal

	PWM3->SM[1].CTRL |= PWM_CTRL_HALF_MASK;      // half cycle reload
	PWM3->SM[1].CTRL &= ~PWM_CTRL_COMPMODE_MASK; // Edge is generated on counter "equal to" value register
	PWM3->SM[1].CTRL &= ~PWM_CTRL_LDMOD_MASK;    // buffered registers take effect at PWM reload signal when LDOK is set
	PWM3->SM[1].CTRL2 = (PWM3->SM[1].CTRL2 & ~PWM_CTRL2_CLK_SEL_MASK)|PWM_CTRL2_CLK_SEL(0);   // use IPBus clock
	PWM3->SM[1].CTRL2 &= ~PWM_CTRL2_INDEP_MASK;  // complementary mode
	PWM3->SM[1].CTRL2 = (PWM3->SM[1].CTRL2 & ~PWM_CTRL2_INIT_SEL_MASK)|PWM_CTRL2_INIT_SEL(3); // use external sync
	PWM3->SM[1].CTRL2 |= PWM_CTRL2_RELOAD_SEL_MASK; // use master reload from SM0

