nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
	/* PWM frequency and duty setting */
#ifdef OVERDRIVE_MODE
	PWM4->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM4->SM[0].VAL1  = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#else
	PWM4->SM[0].INIT  = -((int16_t)(BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ))); // Get INIT value from given PWM frequency
	PWM4->SM[0].VAL1  = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(2.0*M1_PWM_FREQ)-1;             // Get VAL1 value from given PWM frequency
#endif
	PWM4->SM[0].VAL0 = 0;
	PWM4->SM[0].VAL2  = PWM4->SM[0].INIT/2; // 50% duty
	PWM4->SM[0].VAL3  = PWM4->SM[0].VAL1/2; // 50% duty

	PWM4->SM[1].INIT  = PWM4->SM[0].INIT;
	PWM4->SM[1].VAL1  = PWM4->SM[0].VAL1;
	PWM4->SM[1].VAL0 = 0;
	PWM4->SM[1].VAL2  = PWM4->SM[0].VAL2;
	PWM4->SM[1].VAL3  = PWM4->SM[0].VAL3;

	PWM4->SM[2].INIT  = PWM4->SM[0].INIT;
	PWM4->SM[2].VAL1  = PWM4->SM[0].VAL1;
	PWM4->SM[2].VAL0 = 0;
	PWM4->SM[2].VAL2  = PWM4->SM[0].VAL2;
	PWM4->SM[2].VAL3  = PWM4->SM[0].VAL3;

	/* Deadtime setting */
#ifdef OVERDRIVE_MODE
	PWM4->SM[0].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[0].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[1].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[1].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[2].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[2].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/1000000;
#else
	PWM4->SM[0].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[0].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[1].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[1].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[2].DTCNT0 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
	PWM4->SM[2].DTCNT1 = M4_PWM_DEADTIME*BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/1000000;
#endif

	/* Fault protection setting: Fault protects PWMA&PWMB outputs of SM0~SM2 */
	PWM4->SM[0].DISMAP[0] = 0;
	PWM4->SM[1].DISMAP[0] = 0;
	PWM4->SM[2].DISMAP[0] = 0;

	PWM4->SM[0].DISMAP[0] = (PWM4->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M4_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M4_FAULT_NUM);
	PWM4->SM[1].DISMAP[0] = (PWM4->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M4_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M4_FAULT_NUM);
	PWM4->SM[2].DISMAP[0] = (PWM4->SM[0].DISMAP[0] & ~(PWM_DISMAP_DIS0A_MASK|PWM_DISMAP_DIS0B_MASK))|PWM_DISMAP_DIS0A(1<<M4_FAULT_NUM)|PWM_DISMAP_DIS0B(1<<M4_FAULT_NUM);

	PWM4->FCTRL = (PWM4->FCTRL & ~PWM_FCTRL_FLVL_MASK)|PWM_FCTRL_FLVL(1<<M4_FAULT_NUM); // A logic 1 on fault indicates a fault condition
	PWM4->FCTRL = (PWM4->FCTRL & ~PWM_FCTRL_FAUTO_MASK); // Manual clearing for fault0~3
	PWM4->FCTRL = (PWM4->FCTRL & ~PWM_FCTRL_FSAFE_MASK)|PWM_FCTRL_FSAFE(1<<M4_FAULT_NUM); // Safe mode for fault

	PWM4->FSTS = (PWM4->FSTS & ~PWM_FSTS_FFULL_MASK)|PWM_FSTS_FFULL(1<<M4_FAULT_NUM); // Full cycle recovery for fault0
	PWM4->FCTRL2 = (PWM4->FCTRL2 & ~PWM_FCTRL2_NOCOMB_MASK)|PWM_FCTRL2_NOCOMB(1<<M4_FAULT_NUM); // No combinational path for fault. Fault signal will be filtered
	PWM4->FFILT = PWM_FFILT_FILT_CNT(3)|PWM_FFILT_FILT_PER(2);

	/* End of PWM initialization, setting LDOK */
	PWM4->MCTRL = PWM_MCTRL_CLDOK(0x7); // Clear LDOK of SM0~SM2
	PWM4->MCTRL |= PWM_MCTRL_LDOK(0x7); // Set LDOK of SM0~SM2

    /* Initialize MC driver */
    g_sM4Pwm3ph.pui32PwmBaseAddress = (PWM_Type *)PWM4;

    g_sM4Pwm3ph.ui16PhASubNum = M4_PWM_PAIR_PHA; /* PWMA phase A sub-module number */
    g_sM4Pwm3ph.ui16PhBSubNum = M4_PWM_PAIR_PHB; /* PWMA phase B sub-module number */
    g_sM4Pwm3ph.ui16PhCSubNum = M4_PWM_PAIR_PHC; /* PWMA phase C sub-module number */

    g_sM4Pwm3ph.ui16FaultFixNum = M4_FAULT_NUM; /* PWMA fixed-value over-current fault number */
    g_sM4Pwm3ph.ui16FaultAdjNum = M4_FAULT_NUM; /* PWMA adjustable over-current fault number */

}

static void lpadc_channel_assignment(channel_table_t *psChannel)
{
	if(psChannel->sLPADC1IA.ui16Cmd != NOT_EXIST)
	{
		LPADC1->CMD[psChannel->sLPADC1IA.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC1->CMD[psChannel->sLPADC1IA.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC1IA.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC1IA.ui16ChanNum);
		LPADC1->CMD[psChannel->sLPADC1IA.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC1IB.ui16Cmd != NOT_EXIST)
	{
		LPADC1->CMD[psChannel->sLPADC1IB.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC1->CMD[psChannel->sLPADC1IB.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC1IB.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC1IB.ui16ChanNum);
		LPADC1->CMD[psChannel->sLPADC1IB.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC1IC.ui16Cmd != NOT_EXIST)
	{
		LPADC1->CMD[psChannel->sLPADC1IC.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC1->CMD[psChannel->sLPADC1IC.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC1IC.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC1IC.ui16ChanNum);
		LPADC1->CMD[psChannel->sLPADC1IC.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC2IA.ui16Cmd != NOT_EXIST)
	{
		LPADC2->CMD[psChannel->sLPADC2IA.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC2->CMD[psChannel->sLPADC2IA.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC2IA.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC2IA.ui16ChanNum);
		LPADC2->CMD[psChannel->sLPADC2IA.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC2IB.ui16Cmd != NOT_EXIST)
	{
		LPADC2->CMD[psChannel->sLPADC2IB.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC2->CMD[psChannel->sLPADC2IB.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC2IB.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC2IB.ui16ChanNum);
		LPADC2->CMD[psChannel->sLPADC2IB.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC2IC.ui16Cmd != NOT_EXIST)
	{
		LPADC2->CMD[psChannel->sLPADC2IC.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC2->CMD[psChannel->sLPADC2IC.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC2IC.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC2IC.ui16ChanNum);
		LPADC2->CMD[psChannel->sLPADC2IC.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC1VDcb.ui16Cmd != NOT_EXIST)
	{
		LPADC1->CMD[psChannel->sLPADC1VDcb.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC1->CMD[psChannel->sLPADC1VDcb.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC1VDcb.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC1VDcb.ui16ChanNum);
		LPADC1->CMD[psChannel->sLPADC1VDcb.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	else if(psChannel->sLPADC2VDcb.ui16Cmd != NOT_EXIST)
	{
		LPADC2->CMD[psChannel->sLPADC2VDcb.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC2->CMD[psChannel->sLPADC2VDcb.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC2VDcb.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC2VDcb.ui16ChanNum);
		LPADC2->CMD[psChannel->sLPADC2VDcb.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	if(psChannel->sLPADC1Aux.ui16Cmd != NOT_EXIST)
	{
		LPADC1->CMD[psChannel->sLPADC1Aux.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC1->CMD[psChannel->sLPADC1Aux.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC1Aux.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC1Aux.ui16ChanNum);
		LPADC1->CMD[psChannel->sLPADC1Aux.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
	else if(psChannel->sLPADC2Aux.ui16Cmd != NOT_EXIST)
	{
		LPADC2->CMD[psChannel->sLPADC2Aux.ui16Cmd-1].CMDL &= ~ADC_CMDL_CSCALE_MASK; // Input is scaled to 30/64
		LPADC2->CMD[psChannel->sLPADC2Aux.ui16Cmd-1].CMDL |= ADC_CMDL_ABSEL(psChannel->sLPADC2Aux.ui16Side)|\
																					 ADC_CMDL_ADCH(psChannel->sLPADC2Aux.ui16ChanNum);
		LPADC2->CMD[psChannel->sLPADC2Aux.ui16Cmd-1].CMDH = ADC_CMDH_STS(1)|ADC_CMDH_AVGS(psChannel->ui16Average); // 5 cycles for sampling
	}
}

static void lpadc_init(void)
{
	CLOCK_EnableClock(kCLOCK_Lpadc1);
	CLOCK_EnableClock(kCLOCK_Lpadc2);

	LPADC1->CTRL = ADC_CTRL_RSTFIFO_MASK|ADC_CTRL_RST_MASK; // Reset fifo and wrapper logic
	LPADC1->CTRL = ADC_CTRL_TRIG_SRC(0);                    // ADC_ETC trigger only
	LPADC2->CTRL = ADC_CTRL_RSTFIFO_MASK|ADC_CTRL_RST_MASK; // Reset fifo and wrapper logic
	LPADC2->CTRL = ADC_CTRL_TRIG_SRC(0);                    // ADC_ETC trigger only

	LPADC1->CFG |= ADC_CFG_PWREN(1)|ADC_CFG_REFSEL(0)|ADC_CFG_PWRSEL(3); // External VREFH=1.8V, highest power consumption
	LPADC2->CFG |= ADC_CFG_PWREN(1)|ADC_CFG_REFSEL(0)|ADC_CFG_PWRSEL(3); // External VREFH=1.8V, highest power consumption

