nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
	g_sM1AdcSensor.psChannelAssignment = &sChannelTableM1;
	g_sM2AdcSensor.psChannelAssignment = &sChannelTableM2;
	g_sM3AdcSensor.psChannelAssignment = &sChannelTableM3;
	g_sM4AdcSensor.psChannelAssignment = &sChannelTableM4;
	g_sM1AdcSensor.psChannelAssignment->ui16Average = M1_ADC_AVG_NUM;
	g_sM2AdcSensor.psChannelAssignment->ui16Average = M2_ADC_AVG_NUM;
	g_sM3AdcSensor.psChannelAssignment->ui16Average = M3_ADC_AVG_NUM;
	g_sM4AdcSensor.psChannelAssignment->ui16Average = M4_ADC_AVG_NUM;
	lpadc_channel_assignment(g_sM1AdcSensor.psChannelAssignment);
	lpadc_channel_assignment(g_sM2AdcSensor.psChannelAssignment);
	lpadc_channel_assignment(g_sM3AdcSensor.psChannelAssignment);
	lpadc_channel_assignment(g_sM4AdcSensor.psChannelAssignment);



	LPADC1->TCTRL[0] = ADC_TCTRL_CMD_SEL(1)|ADC_TCTRL_HTEN_MASK; // Enable HW trigger for TRIG0 of ADC1, TCMD comes from ADC_ETC
	LPADC2->TCTRL[0] = ADC_TCTRL_CMD_SEL(1)|ADC_TCTRL_HTEN_MASK; // Enable HW trigger for TRIG0 of ADC2, TCMD comes from ADC_ETC

	LPADC1->TCTRL[1] = ADC_TCTRL_CMD_SEL(1)|ADC_TCTRL_HTEN_MASK; // Enable HW trigger for TRIG0 of ADC1, TCMD comes from ADC_ETC
	LPADC2->TCTRL[1] = ADC_TCTRL_CMD_SEL(1)|ADC_TCTRL_HTEN_MASK; // Enable HW trigger for TRIG0 of ADC2, TCMD comes from ADC_ETC


	LPADC1->CTRL |= ADC_CTRL_ADCEN_MASK;
	LPADC2->CTRL |= ADC_CTRL_ADCEN_MASK;
}


void adc_etc_init(void)
{
	lpadc_init();
	g_sM1AdcSensor.ui8MotorNum = MOTOR_1;
	g_sM2AdcSensor.ui8MotorNum = MOTOR_2;
	g_sM3AdcSensor.ui8MotorNum = MOTOR_3;
	g_sM4AdcSensor.ui8MotorNum = MOTOR_4;
	MCDRV_Curr3Ph2ShChanAssignInit(&g_sM1AdcSensor);
	MCDRV_Curr3Ph2ShChanAssignInit(&g_sM2AdcSensor);
	MCDRV_Curr3Ph2ShChanAssignInit(&g_sM3AdcSensor);
	MCDRV_Curr3Ph2ShChanAssignInit(&g_sM4AdcSensor);

	CLOCK_EnableClock(kCLOCK_Adc_Etc);

	ADC_ETC->CTRL = ADC_ETC_CTRL_SOFTRST_MASK; // Reset adc_etc
	ADC_ETC->CTRL &= ~ADC_ETC_CTRL_SOFTRST_MASK;

	ADC_ETC->CTRL = ADC_ETC_CTRL_TRIG_ENABLE(0xF); // TRIG0~3 are enabled

	ADC_ETC->TRIG[0].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[0].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[4].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[4].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[1].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[1].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[5].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[5].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[2].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[2].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[6].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[6].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[3].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[3].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2
	ADC_ETC->TRIG[7].TRIGn_CTRL = 0;
	ADC_ETC->TRIG[7].TRIGn_CTRL = ADC_ETC_TRIGn_CTRL_TRIG_CHAIN(1)|\
								  ADC_ETC_TRIGn_CTRL_SYNC_MODE_MASK|\
								  ADC_ETC_TRIGn_CTRL_TRIG_MODE(0); // HW trigger,sync mode, chain length is 2

	/*
	 *   Example for Motor1:
	 * 				                 	SEG0     SEG1
	 * 				LPADC1 on TRIG0 : IA_ADC1, UDC_ADC1
	 *
	 * 				LPADC2 on TRIG4 : IB_ADC2, IC_ADC2
	 *
	 *
	 * */
	ADC_ETC->TRIG[0].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM1AdcSensor.ui16ADC1Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM1AdcSensor.sCurrSec16.ui16ADC1Seg0CmdNum);
	ADC_ETC->TRIG[4].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM1AdcSensor.ui16ADC2Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM1AdcSensor.sCurrSec16.ui16ADC2Seg0CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_IE1(0)|ADC_ETC_TRIGn_CHAIN_1_0_IE1_EN_MASK; // Generates an interrupt on DONE0 when segment1 of TRIG4 is finished conversion

	ADC_ETC->TRIG[1].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM2AdcSensor.ui16ADC1Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM2AdcSensor.sCurrSec16.ui16ADC1Seg0CmdNum);
	ADC_ETC->TRIG[5].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM2AdcSensor.ui16ADC2Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM2AdcSensor.sCurrSec16.ui16ADC2Seg0CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_IE1(1)|ADC_ETC_TRIGn_CHAIN_1_0_IE1_EN_MASK; // Generates an interrupt on DONE1 when segment1 of TRIG5 is finished conversion

	ADC_ETC->TRIG[2].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM3AdcSensor.ui16ADC1Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM3AdcSensor.sCurrSec16.ui16ADC1Seg0CmdNum);
	ADC_ETC->TRIG[6].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM3AdcSensor.ui16ADC2Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM3AdcSensor.sCurrSec16.ui16ADC2Seg0CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_IE1(2)|ADC_ETC_TRIGn_CHAIN_1_0_IE1_EN_MASK; // Generates an interrupt on DONE2 when segment1 of TRIG6 is finished conversion

	ADC_ETC->TRIG[3].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM4AdcSensor.ui16ADC1Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM4AdcSensor.sCurrSec16.ui16ADC1Seg0CmdNum);
	ADC_ETC->TRIG[7].TRIGn_CHAIN_1_0 = ADC_ETC_TRIGn_CHAIN_1_0_B2B1_MASK|ADC_ETC_TRIGn_CHAIN_1_0_HWTS1(2)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL1(g_sM4AdcSensor.ui16ADC2Seg1CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_HWTS0(1)|ADC_ETC_TRIGn_CHAIN_1_0_CSEL0(g_sM4AdcSensor.sCurrSec16.ui16ADC2Seg0CmdNum)|\
										ADC_ETC_TRIGn_CHAIN_1_0_B2B0_MASK|ADC_ETC_TRIGn_CHAIN_1_0_IE1(3)|ADC_ETC_TRIGn_CHAIN_1_0_IE1_EN_MASK; // Generates an interrupt on DONE3 when segment1 of TRIG7 is finished conversion


	NVIC_SetPriority(ADC_ETC_IRQ0_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	NVIC_EnableIRQ(ADC_ETC_IRQ0_IRQn);
	NVIC_SetPriority(ADC_ETC_IRQ1_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	NVIC_EnableIRQ(ADC_ETC_IRQ1_IRQn);
	NVIC_SetPriority(ADC_ETC_IRQ2_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	NVIC_EnableIRQ(ADC_ETC_IRQ2_IRQn);
	NVIC_SetPriority(ADC_ETC_IRQ3_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	NVIC_EnableIRQ(ADC_ETC_IRQ3_IRQn);

	NVIC_SetPriority(ADC_ETC_ERROR_IRQ_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY);
	NVIC_EnableIRQ(ADC_ETC_ERROR_IRQ_IRQn);
}



static void qdc1_init(void)
{
	CLOCK_EnableClock(kCLOCK_Enc1);

	ENC1->LMOD = 4*M1_ENCODER_LINES-1;
	ENC1->UMOD = 0;
	ENC1->LPOS = 0;
	ENC1->UPOS = 0;
	ENC1->FILT = ENC_FILT_FILT_CNT(2)|ENC_FILT_FILT_PER(1);
	ENC1->CTRL2 |= ENC_CTRL2_MOD_MASK|ENC_CTRL2_REVMOD_MASK; // Enable modulo counting, and REV is controlled by modulo counting
	ENC1->CTRL3 = ENC_CTRL3_PMEN_MASK|ENC_CTRL3_PRSC(M1_QDC_TIMER_PRESCALER);
	ENC1->CTRL |= ENC_CTRL_XIE_MASK; // Enable index signal interrupt

	NVIC_SetPriority(ENC1_IRQn, 3); // Priority 1
	NVIC_EnableIRQ(ENC1_IRQn);

	g_sM1QdcSensor.pQDC_base = ENC1;
	g_sM1QdcSensor.ui8MotorNum = MOTOR_1;
	MCDRV_QdcInit(&g_sM1QdcSensor);
	MCDRV_QdcSpeedCalInit(&g_sM1QdcSensor);
	MCDRV_QdcToSpeedCalInit(&g_sM1QdcSensor);
}

static void qdc2_init(void)
{
	CLOCK_EnableClock(kCLOCK_Enc2);

	ENC2->LMOD = 4*M2_ENCODER_LINES-1;
	ENC2->UMOD = 0;
	ENC2->LPOS = 0;
	ENC2->UPOS = 0;
	ENC2->FILT = ENC_FILT_FILT_CNT(2)|ENC_FILT_FILT_PER(1);
	ENC2->CTRL2 |= ENC_CTRL2_MOD_MASK|ENC_CTRL2_REVMOD_MASK; // Enable modulo counting, and REV is controlled by modulo counting
	ENC2->CTRL3 = ENC_CTRL3_PMEN_MASK|ENC_CTRL3_PRSC(M1_QDC_TIMER_PRESCALER);
	ENC2->CTRL |= ENC_CTRL_XIE_MASK; // Enable index signal interrupt

//	NVIC_SetPriority(ENC2_IRQn, 3); // Priority 1
//	NVIC_EnableIRQ(ENC2_IRQn);

	g_sM2QdcSensor.pQDC_base = ENC2;
	g_sM2QdcSensor.ui8MotorNum = MOTOR_2;
	MCDRV_QdcInit(&g_sM2QdcSensor);
	MCDRV_QdcSpeedCalInit(&g_sM2QdcSensor);
	MCDRV_QdcToSpeedCalInit(&g_sM2QdcSensor);
}

static void qdc3_init(void)
{
	CLOCK_EnableClock(kCLOCK_Enc3);

	ENC3->LMOD = 4*M3_ENCODER_LINES-1;
	ENC3->UMOD = 0;
	ENC3->LPOS = 0;
	ENC3->UPOS = 0;
	ENC3->FILT = ENC_FILT_FILT_CNT(2)|ENC_FILT_FILT_PER(1);
	ENC3->CTRL2 |= ENC_CTRL2_MOD_MASK|ENC_CTRL2_REVMOD_MASK; // Enable modulo counting, and REV is controlled by modulo counting
	ENC3->CTRL3 = ENC_CTRL3_PMEN_MASK|ENC_CTRL3_PRSC(M1_QDC_TIMER_PRESCALER);
	ENC3->CTRL |= ENC_CTRL_XIE_MASK; // Enable index signal interrupt

