nxp-appcodehub/ap-qmc2g-industrial/qmc2g_industrial/app/isi_qmc_dgc/industrial_app_master_cm7/source/motor_control/mc_peripherals_init/mcinit_qmc2g_imxrt1170.c
//	NVIC_SetPriority(ENC3_IRQn, 3); // Priority 1
//	NVIC_EnableIRQ(ENC3_IRQn);

	g_sM3QdcSensor.pQDC_base = ENC3;
	g_sM3QdcSensor.ui8MotorNum = MOTOR_3;
	MCDRV_QdcInit(&g_sM3QdcSensor);
	MCDRV_QdcSpeedCalInit(&g_sM3QdcSensor);
	MCDRV_QdcToSpeedCalInit(&g_sM3QdcSensor);
}

static void qdc4_init(void)
{
	CLOCK_EnableClock(kCLOCK_Enc4);

	ENC4->LMOD = 4*M4_ENCODER_LINES-1;
	ENC4->UMOD = 0;
	ENC4->LPOS = 0;
	ENC4->UPOS = 0;
	ENC4->FILT = ENC_FILT_FILT_CNT(2)|ENC_FILT_FILT_PER(1);
	ENC4->CTRL2 |= ENC_CTRL2_MOD_MASK|ENC_CTRL2_REVMOD_MASK; // Enable modulo counting, and REV is controlled by modulo counting
	ENC4->CTRL3 = ENC_CTRL3_PMEN_MASK|ENC_CTRL3_PRSC(M1_QDC_TIMER_PRESCALER);
	ENC4->CTRL |= ENC_CTRL_XIE_MASK; // Enable index signal interrupt

//	NVIC_SetPriority(ENC4_IRQn, 3); // Priority 1
//	NVIC_EnableIRQ(ENC4_IRQn);

	g_sM4QdcSensor.pQDC_base = ENC4;
	g_sM4QdcSensor.ui8MotorNum = MOTOR_4;
	MCDRV_QdcInit(&g_sM4QdcSensor);
	MCDRV_QdcSpeedCalInit(&g_sM4QdcSensor);
	MCDRV_QdcToSpeedCalInit(&g_sM4QdcSensor);
}

static void pit1_Init(void) // For motor1 slow loop
{
	CLOCK_EnableClock(kCLOCK_Pit1);
	PIT1->MCR &= ~PIT_MCR_MDIS_MASK;
#ifdef OVERDRIVE_MODE
	PIT1->CHANNEL[0].LDVAL = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/M1_SLOW_LOOP_FREQ;
#else
	PIT1->CHANNEL[0].LDVAL = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/M1_SLOW_LOOP_FREQ;
#endif
	PIT1->CHANNEL[0].TFLG = 1; // Clear flag
	PIT1->CHANNEL[0].TCTRL = PIT_TCTRL_TIE_MASK; // Enable interrupt of channel0 timer

	NVIC_SetPriority(PIT1_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY+1);
	NVIC_EnableIRQ(PIT1_IRQn);
}

static void pit2_Init(void) // For motor2 slow loop
{
	CLOCK_EnableClock(kCLOCK_Pit2);
	PIT2->MCR &= ~PIT_MCR_MDIS_MASK;
#ifdef OVERDRIVE_MODE
	PIT2->CHANNEL[0].LDVAL = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_LPSR_CLK_ROOT/M2_SLOW_LOOP_FREQ;
#else
	PIT2->CHANNEL[0].LDVAL = BOARD_BOOTCLOCKRUN_BUS_LPSR_CLK_ROOT/M2_SLOW_LOOP_FREQ;
#endif
	PIT2->CHANNEL[0].TFLG = 1; // Clear flag
	PIT2->CHANNEL[0].TCTRL = PIT_TCTRL_TIE_MASK; // Enable interrupt of channel0 timer

	NVIC_SetPriority(PIT2_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY+1);
	NVIC_EnableIRQ(PIT2_IRQn);
}

static void qtimer1_0_init(void) // For motor3 slow loop
{
	CLOCK_EnableClock(kCLOCK_Qtimer1);

	TMR1->CHANNEL[0].CTRL = TMR_CTRL_PCS(0xB)|TMR_CTRL_CM(0)|TMR_CTRL_LENGTH_MASK; // IP bus clock/8
#ifdef OVERDRIVE_MODE
	TMR1->CHANNEL[0].COMP1 = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(8.0*M3_SLOW_LOOP_FREQ);
#else
	TMR1->CHANNEL[0].COMP1 = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(8.0*M3_SLOW_LOOP_FREQ);
#endif
	TMR1->CHANNEL[0].SCTRL |= TMR_SCTRL_TCFIE_MASK;

	NVIC_SetPriority(TMR1_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY+1);
	NVIC_EnableIRQ(TMR1_IRQn);
}

static void qtimer2_0_init(void) // For motor4 slow loop
{
	CLOCK_EnableClock(kCLOCK_Qtimer2);

	TMR2->CHANNEL[0].CTRL = TMR_CTRL_PCS(0xB)|TMR_CTRL_CM(0)|TMR_CTRL_LENGTH_MASK; // IP bus clock/8
#ifdef OVERDRIVE_MODE
	TMR2->CHANNEL[0].COMP1 = BOARD_BOOTCLOCKOVERDRIVERUN_BUS_CLK_ROOT/(8.0*M4_SLOW_LOOP_FREQ);
#else
	TMR2->CHANNEL[0].COMP1 = BOARD_BOOTCLOCKRUN_BUS_CLK_ROOT/(8.0*M4_SLOW_LOOP_FREQ);
#endif
	TMR2->CHANNEL[0].SCTRL |= TMR_SCTRL_TCFIE_MASK;

	NVIC_SetPriority(TMR2_IRQn, configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY+1);
	NVIC_EnableIRQ(TMR2_IRQn);
}

static void qtimer1_1_init(void)
{
	CLOCK_EnableClock(kCLOCK_Qtimer1);

	TMR1->CHANNEL[1].CTRL = TMR_CTRL_PCS(0x8); // IP bus clock
}

static void qtimer1_2_init(void)
{
	CLOCK_EnableClock(kCLOCK_Qtimer1);

	TMR1->CHANNEL[2].CTRL = TMR_CTRL_PCS(0x8); // IP bus clock
}

static void qtimer1_3_init(void)
{
	CLOCK_EnableClock(kCLOCK_Qtimer1);

	TMR1->CHANNEL[3].CTRL = TMR_CTRL_PCS(0x8); /* IP bus clock */
}


void peripherals_manual_init(void)
{
	/* Must enable clock gates of used peripherals before configuring them */
	eFlexPWM1_init();
	eFlexPWM2_init();
	eFlexPWM3_init();
	eFlexPWM4_init();
	adc_etc_init();
	pit1_Init();
	pit2_Init();
	qtimer1_0_init();
	qtimer2_0_init();
	qdc1_init();
	qdc2_init();
	qdc3_init();
	qdc4_init();
	qtimer1_1_init();
	qtimer1_2_init();
	qtimer1_3_init();
}



